---
kind: type
id: T:Autodesk.Revit.DB.ClassificationEntries
source: html/8bfc4653-1957-0b05-c4da-c31268a22935.htm
---
# Autodesk.Revit.DB.ClassificationEntries

A collection of ClassificationEntry objects that make up the classification table.

## Syntax (C#)
```csharp
public class ClassificationEntries : KeyBasedTreeEntries
```